tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "knqyf263/pet"
tap "romkatv/powerlevel10k"

# Record and share terminal sessions
brew "asciinema"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Configuration editing tool and API
brew "augeas"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"

# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"

# Validating, recursive, caching DNS resolver
brew "unbound"

# GNU Transport Layer Security (TLS) Library
brew "gnutls"

# Emacs dependency management
brew "cask"

# C/C++/ObjC language server
brew "ccls"

# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"

# Console Matrix
brew "cmatrix"

# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"

# Simple file manager written in bash
brew "fff"
# Command-line fuzzy finder written in Go
brew "fzf"

# GNU compiler collection
brew "gcc"

# GitHub command-line tool
brew "gh"

# Distributed revision control system
brew "git"

# Core application library for C
brew "glib"

# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"

# Convert source code to formatted text with syntax highlighting
brew "highlight"

# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"

# Lightweight and flexible command-line JSON processor
brew "jq"

# C library SSHv1/SSHv2 client and server protocols

brew "libssh"

# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit", args: ["HEAD"]

# Java-based project management
brew "maven"

# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"

# Fast, highly customisable system info script
brew "neofetch"

# Parser generator tool and incremental parsing library
brew "tree-sitter", args: ["HEAD"]

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]

# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"

# Highly capable, feature-rich programming language
brew "perl"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Command-line packet analyzer
brew "tcpdump"

# Code-search similar to ack
brew "the_silver_searcher"

# Text interface for Git repositories
brew "tig"

# Simplified and community-driven man pages
brew "tldr"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Vi 'workalike' with many additional features
brew "vim"

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Additional completion definitions for zsh
brew "zsh-completions"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
cask "font-meslo-lg-nerd-font"

# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"


# Added


cask "visual-studio-code"
cask "intellij-idea"
cask "typora"

brew "docker"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "adoptopenjdk11"

